dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/I2C2_1.0.xml
(Core Domain only)" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Bypass"/>
            <bitenum id="CLK_1" value="0x1" description="1 clock"/>
            <bitenum id="CLK_2" value="0x2" description="2 clocks"/>
            <bitenum id="CLK_3" value="0x3" description="3 clocks"/>
            <bitenum id="CLK_4" value="0x4" description="4 clocks"/>
            <bitenum id="CLK_8" value="0x5" description="8 clocks"/>
            <bitenum id="CLK_16" value="0x6" description="16 clocks"/>
            <bitenum id="CLK_31" value="0x7" description="31 clocks"/>
        </bitfield>
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
        <bitfield id="CHAIN" description="Analog and digital noise filters chaining enable." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="When 0, chaining is disabled and only digital filter output is available to IP logic for oversampling"/>
            <bitenum id="ENABLE" value="0x1" description="When 1, analog and digital glitch filters are chained and the output of the combination is made available to IP logic for oversampling"/>
        </bitfield>
    </register>
    <register id="I2C2_TIMEOUT_CTL" width="32" offset="0x1204" description="I2C Timeout Count Control Register">
        <bitfield id="TCNTLA" description="Timeout counter A load value
Counter A is used for SCL low detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout A count. NOTE: The value of CNTLA must be greater than 1h. 

Each count is equal to 520 times the timeout period of functional clock. For example, with 8MHz functional clock and a 100KHz operating I2C clock, one timeout period will be equal to (1 / 8MHz) * 520 or 65 us." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTAEN" description="Timeout Counter A Enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
        <bitfield id="TCNTLB" description="Timeout Count B Load: Counter B is used for SCL High Detection. This field contains the upper 8 bits of a 12-bit pre-load value for the Timeout B count. NOTE: The value of CNTLB must be greater than 1h. 

Each count is equal to 1* clock period. For example, with 10MHz functional clock one timeout period will be equal to1*100ns." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTBEN" description="Timeout Counter B Enable" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Timeout Counter B"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Timeout Counter B"/>
        </bitfield>
    </register>
    <register id="I2C2_TIMEOUT_CNT" width="32" offset="0x1208" description="I2C Timeout Count Register">
        <bitfield id="TCNTA" description="Timeout Count A Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter A" begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="TCNTB" description="Timeout Count B Current Count: This field contains the upper 8 bits of a 12-bit current counter for timeout counter B" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest Value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="I2C2_CONTROLLER" name="I2C2_CONTROLLER" instances="1" offset="0x1210" instaddr="0x40" description="">
        <register id="I2C2_CSA" width="32" offset="0x0" description="I2C Controller Target Address Register">
            <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next Controller operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="TRANSMIT" value="0x0" description="The Controller is in transmit mode."/>
                <bitenum id="RECEIVE" value="0x1" description="The Controller is in receive mode."/>
            </bitfield>
            <bitfield id="TADDR" description="I2C Target Address This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="CMODE" description="This bit selects the adressing mode to be used in Controller mode
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
                <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
            </bitfield>
        </register>
        <register id="I2C2_CCTR" width="32" offset="0x4" description="I2C Controller Control Register">
            <bitfield id="BURSTRUN" description="I2C Controller Enable and start transaction" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="In standard mode, this encoding means the Controller is unable to transmit or receive data."/>
                <bitenum id="ENABLE" value="0x1" description="The Controller is able to transmit or receive data."/>
            </bitfield>
            <bitfield id="START" description="Generate START" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The controller does not generate the START condition."/>
                <bitenum id="ENABLE" value="0x1" description="The controller generates the START or repeated START condition."/>
            </bitfield>
            <bitfield id="STOP" description="Generate STOP" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The controller does not generate the STOP condition."/>
                <bitenum id="ENABLE" value="0x1" description="The controller generates the STOP condition."/>
            </bitfield>
            <bitfield id="ACK" description="Data Acknowledge Enable.
Software needs to configure this bit to send the ACK or NACK." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="The last received data byte of a transaction is not acknowledged automatically by the Controller."/>
                <bitenum id="ENABLE" value="0x1" description="The last received data byte of a transaction is acknowledged automatically by the Controller."/>
            </bitfield>
            <bitfield id="CBLEN" description="I2C transaction length
This field contains the programmed length of bytes of the Transaction." begin="27" end="16" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
            </bitfield>
            <bitfield id="CACKOEN" description="Controller ACK overrride Enable" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1 and the Controller is receiving data and the number of bytes indicated in MBLEN have been received, the state machine will generate an rxdone interrupt and wait at the start of the ACK for FW to indicate if an ACK or NACK should be sent. The ACK or NACK is selected by writing the MCTR register and setting ACK accordingly. The other fields in this register can also be written at this time to continue on with the transaction. If a NACK is sent the state machine will automatically send a Stop."/>
            </bitfield>
            <bitfield id="RD_ON_TXEMPTY" description="Read on TX Empty" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When 1 the Controller will transmit all bytes from the TX FIFO before continuing with the programmed Burst Run Read. If the DIR is not set to Read in the MSA then this bit is ignored. The Start must be set in the MCTR for proper I2C protocol. The Controller will first send the Start Condition, I2C Address with R/W bit set to write, before sending the bytes in the TX FIFO. When the TX FIFO is empty, the I2C transaction will continue as programmed in MTCR and MSA without sending a Stop Condition. This is intended to be used to perform simple I2C command based reads transition that will complete after initiating them without having to get an interrupt to turn the bus around."/>
            </bitfield>
        </register>
        <register id="I2C2_CSR" width="32" offset="0x8" description="I2C Controller Status Register">
            <bitfield id="BUSY" description="I2C Controller FSM Busy
The BUSY bit is set during an ongoing transaction, so is set during the transmit/receive of the amount of data set in MBLEN including START, RESTART, Address and STOP signal generation when required for the current transaction." begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The controller is idle."/>
                <bitenum id="SET" value="0x1" description="The controller is busy."/>
            </bitfield>
            <bitfield id="ERR" description="Error 
The error can be from the Target address not being acknowledged or the transmit data not being acknowledged." begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No error was detected on the last operation."/>
                <bitenum id="SET" value="0x1" description="An error occurred on the last operation."/>
            </bitfield>
            <bitfield id="ADRACK" description="Acknowledge Address" begin="2" end="2" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The transmitted address was acknowledged"/>
                <bitenum id="SET" value="0x1" description="The transmitted address was not acknowledged."/>
            </bitfield>
            <bitfield id="DATACK" description="Acknowledge Data" begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The transmitted data was acknowledged"/>
                <bitenum id="SET" value="0x1" description="The transmitted data was not acknowledged."/>
            </bitfield>
            <bitfield id="ARBLST" description="Arbitration Lost" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C controller won arbitration."/>
                <bitenum id="SET" value="0x1" description="The I2C controller lost arbitration."/>
            </bitfield>
            <bitfield id="IDLE" description="I2C Idle" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C controller is not idle."/>
                <bitenum id="SET" value="0x1" description="The I2C controller is idle."/>
            </bitfield>
            <bitfield id="BUSBSY" description="I2C Bus is Busy
Controller State Machine will wait until this bit is cleared before starting a transaction. When first enabling the Controller in multi Controller environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the MTCR register to start the transaction so that if SCL goes low it will trigger the BUSBSY." begin="6" end="6" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2C bus is idle."/>
                <bitenum id="SET" value="0x1" description="'This Status bit is set on a START or when SCL goes low. It is cleared on a STOP,  or when a SCL high bus busy timeout occurs and SCL and SDA are both high. This status is cleared when the ACTIVE bit is low.   Note that the Controller State Machine will wait until this bit is cleared before starting an I2C transaction. When first enabling the Controller in multi Controller environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the MTCR register to start the transaction so that if SCL goes low it will trigger the BUSBSY."/>
            </bitfield>
            <bitfield id="CBCNT" description="I2C Controller Transaction Count
This field contains the current count-down value of the transaction." begin="27" end="16" width="12" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C2_CRXDATA" width="32" offset="0xC" description="I2C Controller RXData">
            <bitfield id="VALUE" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C2_CTXDATA" width="32" offset="0x10" description="I2C Controller TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C2_CTPR" width="32" offset="0x14" description="I2C Controller Timer Period">
            <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  