dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/I2C2_1.0.xml
        <register id="I2C2_TSR" width="32" offset="0xC" description="I2C Target Status Register">
            <bitfield id="RREQ" description="Receive Request" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding receive data."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has outstanding receive data from the I2C Controller and is using clock stretching to delay the Controller until the data has been read from the TRXDATA FIFO (Target RX FIFO is full)."/>
            </bitfield>
            <bitfield id="TREQ" description="Transmit Request" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="No outstanding transmit request."/>
                <bitenum id="SET" value="0x1" description="The I2C controller has been addressed as a Target transmitter and is using clock stretching to delay the Controller until data has been written to the TTXDATA FIFO (Target TX FIFO is empty)."/>
            </bitfield>
            <bitfield id="OAR2SEL" description="OAR2 Address Matched This bit gets reevaluated after every address comparison." begin="3" end="3" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Either the OAR2 address is not matched or the match is in legacy mode."/>
                <bitenum id="SET" value="0x1" description="OAR2 address matched and ACKed by the Target."/>
            </bitfield>
            <bitfield id="QCMDST" description="Quick Command Status
Value Description:
0: The last transaction was a normal transaction or a transaction has not occurred.
1: The last transaction was a Quick Command transaction" begin="4" end="4" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The last transaction was a normal transaction or a transaction has not occurred."/>
                <bitenum id="SET" value="0x1" description="The last transaction was a Quick Command transaction."/>
            </bitfield>
            <bitfield id="QCMDRW" description="Quick Command Read / Write 
This bit only has meaning when the QCMDST bit is set. 
Value Description:
0: Quick command was a write
1: Quick command was a read" begin="5" end="5" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="Quick command was a write"/>
                <bitenum id="SET" value="0x1" description="Quick command was a read"/>
            </bitfield>
            <bitfield id="RXMODE" description="Target FSM is in Rx MODE" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
                <bitenum id="SET" value="0x1" description="The Target State Machine is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK state with the bus direction set to write."/>
            </bitfield>
            <bitfield id="BUSBSY" description="I2C bus is busy" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The I2C Bus is not busy"/>
                <bitenum id="SET" value="0x1" description="The I2C Bus is busy. This is cleared on a timeout."/>
            </bitfield>
            <bitfield id="TXMODE" description="Target FSM is in TX MODE" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="The Target State Machine is not in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
                <bitenum id="SET" value="0x1" description="The Target State Machine is in TX_DATA, TX_WAIT, TX_ACK  or ADDR_ACK state with the bus direction set to read."/>
            </bitfield>
            <bitfield id="STALE_TXFIFO" description="Stale Tx FIFO" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLEARED" value="0x0" description="Tx FIFO is not stale"/>
                <bitenum id="SET" value="0x1" description="The TX FIFO is stale. This occurs when the TX FIFO was not emptied during the previous I2C transaction."/>
            </bitfield>
            <bitfield id="ADDRMATCH" description="Indicates the address for which Target address match happened" begin="18" end="9" width="10" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x3FF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="I2C2_TRXDATA" width="32" offset="0x10" description="I2C Target RXData">
            <bitfield id="VALUE" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C2_TTXDATA" width="32" offset="0x14" description="I2C Target TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C2_TACKCTL" width="32" offset="0x18" description="I2C Target ACK Control">
            <bitfield id="ACKOEN" description="I2C Target ACK Override Enable" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="A response in not provided."/>
                <bitenum id="ENABLE" value="0x1" description="An ACK or NACK is sent according to the value written to the ACKOVAL bit."/>
            </bitfield>
            <bitfield id="ACKOVAL" description="I2C Target ACK Override Value
Note: for General Call this bit will be ignored if set to NACK and Target continues to receive data." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="An ACK is sent indicating valid data or command."/>
                <bitenum id="ENABLE" value="0x1" description="A NACK is sent indicating invalid data or command."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_START" description="When set this bit will automatically turn on the Target ACKOEN field following a Start Condition." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following a Start Condition."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_PECNEXT" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the byte received just prior to the PEC byte.
Note that when ACKOEN is set the PEC byte will not automatically be ACKed/NACKed by the State Machine and FW must perform this function by writing Target_SACKCTL." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the byte received just prior to the PEC byte. Note that when ACKOEN is set the PEC byte will not automatically be ACKed/NACKed by the State Machine and FW must perform this function by writing Target_SACKCTL."/>
            </bitfield>
            <bitfield id="ACKOEN_ON_PECDONE" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the received PEC byte." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
                <bitenum id="ENABLE" value="0x1" description="When set this bit will automatically turn on the Target ACKOEN field following the ACK/NACK of the received PEC byte."/>
            </bitfield>
        </register>
